#!/bin/bash

<<COMMENT
++    --   +      -     *    / 
**    %    +=     -=    *=   /=
%=    &&   ||     >     >=   <
<=    表达式?表达式:表达式

Shell 支持多种算术运算，使用 $((表达式))、$[表达式]、let表达式进行整数的算术运算        
bc 命令可以进行小数运算         
COMMENT

echo $((2+4))
echo $((2-4))
echo $((2*4))
echo $((2**4)) # 2的4次幂
echo $((10%3)) # 10除以3后返回余数
x=2 # 定义变量并赋值
echo $((x+=2)) 
echo $((x*=3)) 
echo $((x%=2)) 
x=2; y=3;  # 定义2个变量并赋值
echo $((x*y)) 
echo $x $y  # x, y 自身的值不变
echo $((3>2 && 5>3)) # 仅当&&两个的表达式都为真时，返回1
echo $((3>2 && 5>9)) # 当&&两边的表达式任意为假时，返回0
echo $((3>8 && 5>9))
echo $((1>2 || 5>8)) # 仅当||两边的表达式都为假时，返回0
echo $((3>2 || 5>9)) # 当||两边的表达式都为真时，返回1
echo $((1>2 || 5>2))
echo $[2+8]
echo $[2**8]
x=3; y=5;
echo $[x+y]
echo $[x*y]
echo $[1+2*3] # 先计算乘除法，再计算加减法
echo $[(1+2)*3] # 使用()让计算机先计算加减法，再计算乘除法
echo $[x>y?2:3] # 如果x大于y，返回2，否则返回3
echo $[y>x?2:3] # 如果y大于x，返回2，否则返回3
echo $[y>x?2+2:3*5] 
echo $[x>y?2+2:3*5] 

######################################################################
# 使用内置命令let进行算术运算，默认不输出运算的结果       
######################################################################
echo 
echo "let进行算术运算"
let 1+2 # 无任何输出结果
x=5  # 变量赋初始值
let x++ # x=x+1(x=5+1)
echo $x 
let x*=2; echo $x
let i=1+2*3; echo $i
let i=(1+2)*3; echo $i
let 2.2+5.5 # let 无法进行小数运算
x=1 # 变量赋值初始值
echo $[x++]
echo $x # 此时x的值为2
x=6
echo $[x--] # 先调用x，屏幕显示6，再对x自减1
echo $x  # 此时x的值已经为5
x=1 
echo $[++x] # 先对x自加1，再显示，结果为2
x=6
echo $[--x] # 先对x自减1，再显示，结果为5


######################################################################
# Bash不支持任意精度小数的运算，不支持编写计算函数。需要用bc实现小数计算
# 交互模式：
# bc内置变量 scale 可以指定小数点位数
# 2/10 仅显示整数部分的值
# 2^3 计算幂运算
# quit 退出计算器
# 
# 非交互模式：
# ibase(in)  指定输入数字的进制
# obase(out) 设置输出数字的进制
# 默认输入和输出的数字都是十进制的
######################################################################
echo 
echo "bc实现小数运算："
x=$(echo "(1+2)*3" | bc)
echo $x
echo "2+3; sclae=2; 8/19" | bc
echo "obase=2;10" | bc # 输入十进制，输出对应二进制
echo "obase=8;10" | bc # 十进制转八进制
echo "obase=16;10" | bc # 十进制转十六进制
echo "ibase=2;11" | bc # 输入二进制，输出对应的十进制
echo "ibase=16;FF" | bc # 十六进制转十进制
echo "obase=2;2+8" | bc # 输入十进制，输出二进制结果
echo "length(22833)" | bc # 统计数字的长度